#+TITLE: Valid Parentheses
#+DATE: <2026-06-13>
#+FILETAGS: :leetcode:stack:
#+PROPERTY: header-args :results output :session *shared*

** Solution

#+begin_src python
class Solution:
    def isValid(self, s: str) -> bool:
        if len(s) % 2:
            return False
        stack = []
        match = {")": "(", "}": "{", "]": "["}
        opening = match.values()
        for c in s:
            if c in opening:
                stack.append(c)
            else:
                if not stack or stack.pop() != match[c]:
                    return False
        return not len(stack)
        

s = "([])"
print(Solution().isValid(s))
# Output: true


s = "([)]"
print(Solution().isValid(s))

s = "()[]{}"
print(Solution().isValid(s))
# Output: false
        
#+end_src

#+RESULTS:
: True
: False
: True

_Me_:

How does this solution look?

_AI_:

The solution is correct and clean. A couple of minor observations:

- =if not len(stack)= is fine, but =if not stack= is more idiomatic in Python.
- The final check can be simplified to =return not stack= instead of the if/else.

Otherwise, it handles all cases properly: matching, order, and early exit on mismatch. Good work.

#+RESULTS:
: True
: False
: True

